// Japanese token boundaries that should be restored after Kuromoji tokenization.
// Keys/values were historically kept in the general LANG_TOKEN_REGROUPS table.
const japaneseTokenRegroups: string[] = [
	"とは", "います", "いません", "あります", "ありません", "ません", "したい", "して", "ではありません", "ございます", "間に", "欧州連合", "でしょう","でしょうか","何回","眠りに就きます",
	"0羽","1羽","2羽","3羽","4羽","5羽","6羽","7羽","8羽","9羽","何羽", "一羽",
	"次のうち","のうち", "調理師", "看護師", "指差し", "でした", "だった", "いた",
	"番目", "研究室", "ました", "指さして", "指差して", "ですか", "どうやって", "します", "どうすれば", "いいよ",
	"ほうがいいよ", "ほうがいい", "ですよ", "名前を付け", "すれば", "ましょう",
	"しません", "初めまして", "航空会社", "お願いします", "遮るとき", "ハロウィーン", "てしまいます", "可能性",
	"基本的", "建設現場", "なければ", "なりません", "なければなりません", "長い間", "映画館", "した", "しました",
	"写真家", "こともある", "がって", "バスルーム", "消防士", "広東語", "万歳", "なって", "されます", "難易度", "私たち", "地下牢", "魔水", "通って", "高いところ", "ちょっと待って", "先ほど", "くして",
	"コインランドリー", "漫画本", "亡くした",
	"水やり", "配管工", "立って", "数匹", "いくらかかり", "行方不明", "くした", "失くし", "失くした", "連れて", "頼んだ", "音楽を流し", "台所の流し", "労働者", "してる", "お金を引き出した", "歯を磨く", "歯を磨い", "ついた", "ついて", "菜食主義者", "水道料金", "水道代", "電気代", "請求書", "応急処置", "救急箱", "救急車", "スマートフォン", "だろう", "引いた", "並んで", "テキストメッセージ", "充電器", "テレビ番組", "に対して支払う", "たかった", "健康状態", "バックパック",
	"ひいた", "風邪を引いた", "シャワーを浴び", "シャワーを浴びる", "よりも", "背が高い", "ことも", "ありました", "ことが", "ジェットコースター", "ラップトップ", "ランドマーク", "早く起き", "早く起きる", "準備が整い", "夜更かし", "スーパーヒーロー", "かもしれない", "手に入れ", "手に入れる", "携帯電話", "遊園地", "信号機", "通い始め", "誕生日",
	"一組",
	"誰か", "じゃない", "青リンゴ",
	"きょうだい",
	"きます", "きました", "きた", "きて", "きません", "ビデオゲーム",
	"食料品", "一冊", "ドイツ語", "建設作業員",
	// 202510:
	"助けて", "わくわくしている",
	"お腹がすいている","お腹がすいた","お腹がすい",
	"喉が渇いている","喉が渇いた","喉が渇い",
	"静かな",
	"歳をとった", "年をとった", "歳を取った", "年を取った",
	"バスタブ",
	"お兄さん", "お姉さん",
	"十一","十二","十三","十四","十五","十六","十七","十八","十九","二十","二十一","二十二","二十三","二十四",
	"見て", "もっといい", "もっと悪い", "宇宙飛行士", "科学者", "警察署", "長さ","濡れた", "洗濯機", "背が低い",
	"ふね", "クリケットボール", "ショートパンツ", "一時停止", "ヘッドフォン", "ボードゲーム", "トランプゲーム", "カードゲーム", "再生する", "の上", "の下", "の間", "上に", "下に",
	"練習帳", "一度",
	// "には", // <- removed to treat as ["に","は"] instead, and dynamically change the gloss on ["に"] when it means "regarding it" // technically should only be combined when preceded by nouns and plain verbs, and should be separated when preceded by locations
	"いますか", "ますか", "ありますか", "何つ", "いつ", "ましたか", "どれくらい", "いました", "されて", "ように", "しまい",
	"オレンジ色", // ~
	"おやつ", "疲れている", "疲れていて", "怒っている", "わくわくしています", "わくわくしている", "ワクワクしている", "ワクワクしてます", "具合が悪い", "宿泊客", "背の高い", "背の低い", "ありがとうございます", "またね", "言われた", "年を取っている", "でしたか", "ばんそうこう", // "味わうました",
	"書かれて", "そうです", "そうですか", "そうですね", "力が強い",
	"りんご", "おらず", "具合が悪そう",
	"ハリー・ポッター", "アルベルト・アインシュタイン", "リリー・ポッター", "ネビル・ロングボトム", "ジェームズ・ポッター", "ひげ", "のか",
	"ほしがり", "キウイフルーツ",
	"でできて", "行けば", "何でできて",
];

export default japaneseTokenRegroups;
